Revit 2024 API
APIObject.IsReadOnly Property
Identifies if the object is read-only or modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool IsReadOnly { get; }
Visual Basic
Public Overridable ReadOnly Property IsReadOnly As Boolean
	Get
Visual C++
public:
virtual property bool IsReadOnly {
	bool get ();
}
Field Value
If true, the object may not be modified. If false, the object's contents may be modified.
Examples
CopyC#
Document project = uiApplication.ActiveUIDocument.Document;
Settings settings = project.Settings;
TaskDialog.Show("Revit","Categories: " + settings.Categories.IsReadOnly.ToString());
CopyVB.NET
Dim project As Document = uiApplication.ActiveUIDocument.Document
Dim settings As Settings = project.Settings
TaskDialog.Show("Revit", "Categories: " + settings.Categories.IsReadOnly.ToString())
See Also
APIObject Class
Autodesk.Revit.DB Namespace